package step04;

/* 별 도형 그리기
 * 
 */
public class Test04ex1 {

  public static void main(String[] args) {
    /* 문제1. 직각 삼각형 출력하기
     * 밑변의 별 개수? 8
     * (홀수 짝수 상관 없다.)
     * *
     * **
     * ***
     * ****
     * *****
     * ******
     * *******
     * ********
     */
    
    /* 문제2. 직각 삼각형 출력하기2
     * 밑변의 별 개수? 8
     * (홀수 짝수 상관 없다.)
     *        *
     *       **
     *      ***
     *     ****
     *    *****
     *   ******
     *  *******
     * ********
     */
    
    /* 문제3. 역삼각형 출력하기
     * 밑변의 별 개수? 8
     * (만약 짝수가 입력된다면 하나 증가시켜서 홀수로 만든다.)
     * *********
     *  *******
     *   *****
     *    ***
     *     *
     */
    
    /* 문제4. 삼각형 출력하기
     * 밑변의 별 개수? 8
     * (만약 짝수가 입력된다면 하나 증가시켜서 홀수로 만든다.)
     *     * 
     *    ***
     *   *****
     *  *******
     * *********
     */

  }

}
